export const WORKSTEPS = [
  {
    duty: "美術企劃",
    time: "2014/11 - 2015/08",
    company: "天下數位科技",
    type: "平面設計／美編",
    desc: "「美術及美術以外的事情都做了，這個人真好用」由於是第一份有薪轉證明的工作，盡心的完成本職上的事務，也努力的把其他各種交辦事務完成，獲得了很多專案多開及雜工的心得。",
    content: `<ul>
      <li>1.年度T恤制服設計</li>
      <li>2.邀請卡設計</li>
      <li>3.年度紙本、電子型錄設計</li>
      <li>4.雜誌廣告DM設計</li>
      <li>5.網頁BANNER製作、網頁管理(僅HTML、CSS)</li>
      <li>6.繪製LINE貼圖</li>
      <li>7.印前相關事務(如贈品貼紙、禮品包裝、實體海報)</li>
      <li>8.APP企劃UI視覺規劃</li>
      <li>9.管理行企倉庫</li>
      <li>10.協助翻譯簡單日文</li>
      </ul>`,
  },
  {
    duty: "網站視覺設計",
    time: "2016/02 - 2016/09",
    company: "富格曼科技",
    type: "平面設計／美編",
    desc: "「獨挑大樑的視覺設計」任職的部門位於台中，主要面對中國網路娛樂遊戲，當時視覺設計只有我一位，因此與美術相關的工作都必須全部攬下來獨自處理，是一段充實又豐富的經歷。",
    content: `
        <ul>
        <li>1.新官網頁面UI視覺設計</li>
        <li>2.遊戲活動線上推廣Banner</li>
        <li>3.各節日線上慶賀Banner</li>
        <li>4.部分活動披露網頁</li>
        <li>5.公司對外用商務名片</li>
        <li>6.實體禮贈品包裝</li>
        <li>7.協助PM優化提案文件美術</li>
        `,
  }, 
  {
    duty: "美術設計",
    time: "2017/11~2019/12",
    company: "星曜洋行",
    type: "商業設計",
    desc: "「工作與夢想同步進行」這是一份兼職，同時期也開始進行個人接案活動，忙碌有衝勁的生活。",
    content: `<ul>
            <li>1.官方網站各類商業線上推廣Banner、DM</li>
            <li>2.社群網站定期頁面圖、活動圖</li>
            <li>3.實體店面各類裝飾圖、宣傳DM</li>
            <li>4.各類大圖輸出等宣傳品項</li>
            <li>5.實體店面裝潢改造3D構圖</li>
            <li>6.部分商品商業攝影</li>
            </ul> `,
  },  
  {
    duty: "視覺設計師、網站工程師",
    time: "2021/11~2023/05",
    company: "萬家源有限公司",
    type: "網頁設計師",
    desc: "作業量多產，且包山包海，設計跨前端",
    content: `<ul>
            <li>1.製作CSS樣式框架並撰寫成樣式表網站給同仁使用</li>
            <li>2.使用Git控管樣式表版本</li>
            <li>3.使用wordpress佈景主題切版</li>
            <li>4.HTML、CSS、JS網頁前端製作</li>
            <li>5.與網站企劃溝通、製作網站UI視覺設計</li>
            <li>6.社群圖文、廣告設計</li>
            <li>7.印刷品設計</li>
            <li>8.影片剪輯</li>
            </ul> `,
  },
  {
    duty: "網站設計師、網站工程師",
    time: "2024/09~2024/12",
    company: "默聲創意有限公司",
    type: "網站設計師、網站工程師",
    desc: "從設計到建置，壓縮到極限的產能服務多樣化客戶",
    content: `<ul>
            <li>1.使用wordpress佈景主題切版</li>
            <li>2.HTML、CSS、JS網頁前端製作</li>
            <li>3.與專案經理溝通、製作網站UI視覺設計</li>
            <li>4.網站維運</li>
            </ul> `,
  },
];
export const SOHOSTEPS = [  
  {
    duty: "數位美術插畫、漫畫製作",
    time: "2016/10 - 2018/01",
    company: "自營插畫、漫畫工作者",
    type: "美術設計",
    desc: "「夢想要當飯吃目前還有點難」人生應該要有一次，嘗試追逐夢想，曾經追逐過夢想的人，才能更瞭解世界的運作，掌握自己的方向。",
    content: `<ul>
            <li>1.在線上漫畫平台發布漫畫</li>
            <li>2.經營個人品牌粉絲團</li>
            <li>3.研究日韓漫畫平台</li>
            <li>4.參與國內外多項比賽</li>                   
            </ul> `,
  },  
  {
    duty: "設計兼網站工程師",
    time: "2018/01~仍在職",
    company: "日月柴工房",
    type: "美術設計",
    desc: "「審時度勢、危機與轉機之間」最好的組合，是工作+接案、兼職+接案，相信也是許多當代年輕人的選擇。當然，如果工作的薪資福利足夠、又能發揮所長的話...",
    content: `<ul>
            <li>1.Next.js、React.js、wordpress網站製作</li>
            <li>2.網站佈署技術指導</li>
            <li>3.網站前台、後台頁面UI設計</li>
            <li>4.各類Menu、DM設計</li>
            <li>5.餐廳、飲料品牌相關CIS設計</li>
            <li>6.商品發布會沉浸式簡報美化</li>
            <li>7.簡易商業攝影</li>
            <li>8.形象人物(吉祥物)設計</li>
            <li>9.Line貼圖設計</li>
            <li>10.粉絲團活動圖</li>
            <li>11.漫畫接案製作</li>
            <li>12.漫畫影片式廣告(日式廣告)設計</li>
            </ul> `,
  },  
];

